import {importDoc} from '@utils/formatters';
import {IDocumentsListGroup, type IDocumentsList} from '@utils/types';

export const innerRules: IDocumentsList[] = [
    {
        title:
            'Правила надання юридичним особам та фізичним особам - підприємцям фінансової послуги з надання коштів та банківських металів у кредит, діють з 06.03.2024',
        link: importDoc(
            'PRAVYLA-nadannia-yur.os.-ta-pidpryiemtsiam-nadannia-koshtiv-ta-bank.met.-u-kredyt.pdf'
        )
    }
];

export const infoFinancialInstitution: IDocumentsList[] = [
    {
        title:
            'Порядок розгляду ТОВ «СЕНТ ПРО» звернень споживачів фінансових послуг',
        link: importDoc(
            '3_Poriadok rozghliadu zvernen spozhyvachiv TOV SENT PRO_2025.pdf'
        )
    },
    {
        title:
            'ВИМОГИ ТОВ «СЕНТ ПРО» щодо взаємодії із Позичальником (Боржником) та іншими особами\n' +
            'при врегулюванні простроченої заборгованості за кредитним договором, ПОРЯДОК\n' +
            'ВЗАЄМОДІЇ ТОВ «СЕНТ ПРО» із Позичальником (Боржником) при врегулюванні простроченої\n' +
            'заборгованості, повідомлення кредитодавця, нового кредитора та/або колекторської компанії\n' +
            'про те, що інтереси споживача фінансових послуг при врегулюванні простроченої\n' +
            'заборгованості представляє його уповноважений представник (ВИМОГИ ЩОДО ЕТИЧНОЇ\n' +
            'ПОВЕДІНКИ)',
        link: importDoc(
            '4_Vymohy do etychnoi povedinky ta poriadok vzaiemodii_2025.pdf'
        )
    },
    {
        title:
            'Порядок і спосіб погашення простроченої заборгованості у ТОВ «СЕНТ ПРО»',
        link: importDoc(
            '5_Poriadok i sposib pohashennia prostrochenoi zaborhovanosti.pdf'
        )
    },
    {
        title:
            'Відомості про колекторські компанії, з якими ТОВАРИСТВМ З ОБМЕЖЕНОЮ\n' +
            'ВІДПОВІДАЛЬНІСТЮ «СЕНТ ПРО» укладено договір врегулювання заборгованості та порядок\n' +
            'розгляду нею звернень громадян',
        link: importDoc('6_Vidomosti pro kolektorski kompanii.pdf')
    },
    {
        title:
            'Умови, за яких (ТОВ «СЕНТ ПРО») кредитодавець, новий кредитор розпочинає діяльність з\n' +
            'врегулювання простроченої заборгованості',
        link: importDoc(
            '7_Umovy pochatku vrehuliuvannia prostrochenoi zaborhovanosti.pdf'
        )
    },
    {
        title:
            'Порядок відступлення права вимоги за договором про споживчий кредит новому\n' +
            'кредитодавцю',
        link: importDoc('8_Poriadok vidstuplennia prava vymohy.pdf')
    },
    {
        title:
            'Перелік контактних даних (ТОВ «СЕНТ ПРО») кредитодавця, нового кредитора, за якими\n' +
            'приймаються звернення споживачів фінансових послуг щодо діяльності залученої\n' +
            'колекторської компанії (у разі залучення колекторської компанії до врегулювання\n' +
            'простроченої заборгованості)',
        link: importDoc('9_Perelik kontaktnykh danykh.pdf')
    },
    {
        title: 'Свідоцтво про реєстрацію фінансової установи',
        link: importDoc('svid-reestr.pdf')
    },
    {
        title: 'Розпорядження про видачу ліцензій',
        link: importDoc('rozp-lic.pdf')
    },
    {
        title: 'Виписка з єдиного державного реєстру',
        link: importDoc('vypyska-edr.pdf')
    },
    {
        title:
            'Інформація щодо ТОВ «СЕНТ ПРО», умов та порядку діяльності, уключно щодо фінансових послуг, які надаються ТОВ «СЕНТ ПРО» клієнту',
        link: importDoc(
            'Informatsiia shchodo, umov ta poriadku diialnosti TOV SENT PRO.pdf'
        )
    },
    {
        title: 'Порядок обробки і захисту персональних даних у ТОВ «СЕНТ ПРО»',
        link: importDoc(
            'ПОРЯДОК обробки і захисту персональних даних у ТОВ СЕНТ ПРО.pdf'
        )
    },
    {
        title: 'Публічна інформація про ТОВ «СЕНТ ПРО»',
        link: importDoc(
            '2_Publichna informatsiia pro kompaniiu TOV SENT PRO_2025.pdf'
        )
    }
];

export const infoOwnershipStructure: IDocumentsListGroup[] = [
    {
        groupTitle: '2026',
        list: [
            {
                title:
                    'Схематичне зображення структури власності ТОВ СЕНТ ПРО; станом на 01.01.2026',
                link: importDoc(
                    '1.Structura 2026.pdf'
                )
            },
            {
                title:
                    'Відомості про остаточних ключових учасників та власників істотної участі у структурі власності\n' +
                    'надавача фінансових послуг ТОВ СЕНТ ПРО; станом на 01.01.2026',
                link: importDoc(
                    '2.Vidomosti 2026.pdf'
                )
            },
        ]
    },
    {
        groupTitle: '2025',
        list: [
            {
                title:
                    'Схематичне зображення структури власності ТОВ "СЕНТ ПРО" станом на 28.01.2025',
                link: importDoc(
                    '1_Skhematychne zobrazhennia struktury vlasnosti TOV SENT PRO na 28.01.2025.pdf'
                )
            },
            {
                title:
                    'Відомості про остаточних ключових учасників у структурі власності надавача фінансових послуг ТОВ "СЕНТ ПРО" станом на 28.01.2025',
                link: importDoc(
                    '2_Vidomosti pro ostatochnykh kliuchovykh uchasnykiv TOV SENT PRO na 28.01.2025.pdf'
                )
            },
            {
                title:
                    'Відомості про власників істотної участі в надавачі фінансових послуг ТОВ "СЕНТ ПРО" станом на 28.01.2025',
                link: importDoc(
                    '3_Vidomosti pro vlasnykiv istotnoi uchasti TOV SENT PRO na 28.01.2025.pdf'
                )
            },
            {
                title:
                    'Схематичне зображення структури власності ТОВ "СЕНТ ПРО" станом на 01.01.2025',
                link: importDoc(
                    '1_Skhem. zobrazh. struktury vlas. TOV SENT PRO na 01.01.2025.pdf'
                )
            },
            {
                title:
                    'Відомості про остаточних ключових учасників у структурі власності надавача фінансових послуг ТОВ "СЕНТ ПРО" станом на 01.01.2025',
                link: importDoc(
                    '2_Vidomosti pro ost.kl.uchasn TOV SENT PRO na 01.01.2025.pdf'
                )
            },
            {
                title:
                    'Відомості про власників істотної участі в надавачі фінансових послуг ТОВ "СЕНТ ПРО" станом на 01.01.2025',
                link: importDoc(
                    '3_Vidomosti pro vlasn. ist.uch. TOV SENT PRO na 01.01.2025.pdf'
                )
            }
        ]
    },
    {
        groupTitle: '2024',
        list: [
            {
                title:
                    'Схематичне зображення структури власності ТОВ "СЕНТ ПРО" станом на 01.01.2024',
                link: importDoc(
                    '1_Skhematychne-zobrazhennia-struktury-vlasnosti-TOV-SENT-PRO-na-01.01.2024.pdf'
                )
            },
            {
                title:
                    'Відомості про остаточних ключових учасників у структурі власності надавача фінансових послуг ТОВ "СЕНТ ПРО" станом на 01.01.2024',
                link: importDoc(
                    '2_Vidomosti-pro-ostatochnykh-kliuchovykh-uchasnykiv-TOV-SENT-PRO-na-01.01.2024-dod.2.pdf'
                )
            },
            {
                title:
                    'Відомості про власників істотної участі в надавачі фінансових послуг ТОВ "СЕНТ ПРО" станом на 01.01.2024',
                link: importDoc(
                    '3_Vidomosti-pro-vlasnykiv-istotnoi-uchasti-TOV-SENT-PRO-na-01.01.2024-dod.3.pdf'
                )
            }
        ]
    },
    {
        groupTitle: '2023',
        list: [
            {
                title:
                    'Схематичне зображення структури власності ТОВ "СЕНТ ПРО" станом на 01.01.2023',
                link: importDoc(
                    '1_Skhematychne-zobrazhennia-struktury-vlasnosti-TOV-SENT-PRO-na-01.01.2023.pdf'
                )
            },
            {
                title:
                    'Відомості про остаточних ключових учасників у структурі власності надавача фінансових послуг ТОВ "СЕНТ ПРО" станом на 01.01.2023',
                link: importDoc(
                    '2_Vidomosti-pro-ostatochnykh-kliuchovykh-uchasnykiv-TOV-SENT-PRO-na-01.01.2023-dod.2.pdf'
                )
            },
            {
                title:
                    'Відомості про власників істотної участі в надавачі фінансових послуг ТОВ "СЕНТ ПРО" станом на 01.01.2023',
                link: importDoc(
                    '3_Vidomosti-pro-vlasnykiv-istotnoi-uchasti-TOV-SENT-PRO-na-01.01.2023-dod.3.pdf'
                )
            }
        ]
    },
    {
        groupTitle: '2022',
        list: [
            {
                title:
                    'Схематичне зображення структури власності ТОВ "СЕНТ ПРО" станом на 01.01.2022',
                link: importDoc(
                    '1_Skhematychne-zobrazhennia-struktury-vlasnosti-TOV-Sent-Pro-stanom-na-01.01.2022.pdf'
                )
            },
            {
                title:
                    'Відомості про остаточних ключових учасників у структурі власності надавача фінансових послуг ТОВ "СЕНТ ПРО" станом на 01.01.2022',
                link: importDoc(
                    '2_Vidomosti-pro-ostatochnykh-kliuchovykh-uchasnykiv_01.01.2022.pdf'
                )
            },
            {
                title:
                    'Відомості про власників істотної участі в надавачі фінансових послуг ТОВ "СЕНТ ПРО" станом на 01.01.2022',
                link: importDoc(
                    '3_Vidomosti-pro-vlasnykiv-istotnoi-uchasti_01.01.2022.pdf'
                )
            }
        ]
    }
];

export const financeReports: IDocumentsListGroup[] = [
    {
        groupTitle: '2025',
        list: [
            {
                title: 'Примітки до фінансової звітності за 1 півріччя 2025 року',
                link: importDoc(
                    'Примітки до фінансової звітності за 1 ппівріччя 2025 року.pdf'
                )
            },
            {
                title: 'Баланс (Звіт про фінансовий стан) станом на 30.06.2025 р.',
                link: importDoc(
                    'Баланс (Звіт про фінансовий стан) станом на 30.06.2025 р..pdf'
                )
            },
            {
                title:
                    'Звiт про рух грошових коштiв (за прямим методом) за 1 півріччя  2025 р.',
                link: importDoc(
                    'Звiт про рух грошових коштiв (за прямим методом) за 1 півріччя  2025 р.pdf'
                )
            },
            {
                title: 'Звіт про власний капітал за 1 півріччя 2025 р.',
                link: importDoc('Звіт про власний капітал за 1 півріччя 2025 р.pdf')
            },
            {
                title:
                    'Звіт про фінансові результати (про сукупний дохід) за 1 півріччя 2025 р.',
                link: importDoc(
                    'Звіт про фінансові результати (про сукупний дохід) за 1 півріччя 2025 р.pdf'
                )
            },
            {
                title:
                    'Звiт про рух грошових коштiв (за прямим методом) за 1 квартал 2025 р..pdf',
                link: importDoc(
                    '/reports/2025/3m/Звiт про рух грошових коштiв (за прямим методом) за 1 квартал 2025 р..pdf'
                )
            },
            {
                title: 'Звіт про власний капітал за 1 квартал 2025 р..pdf',
                link: importDoc(
                    '/reports/2025/3m/Звіт про власний капітал за 1 квартал 2025 р..pdf'
                )
            },
            {
                title:
                    'Звіт про фінансові результати (про сукупний дохід) за 1 квартал 2025 р.pdf',
                link: importDoc(
                    '/reports/2025/3m/Звіт про фінансові результати (про сукупний дохід) за 1 квартал 2025 р.pdf'
                )
            },
            {
                title: 'Примітки до фінансової звітності за 1 квартал 2025 року.pdf',
                link: importDoc(
                    '/reports/2025/3m/Примітки до фінансової звітності за 1 квартал 2025 року.pdf'
                )
            },
            {
                title: 'Баланс (Звіт про фінансовий стан) станом на 31.03.2025 р..pdf',
                link: importDoc(
                    '/reports/2025/3m/Баланс (Звіт про фінансовий стан) станом на 31.03.2025 р..pdf'
                )
            }
        ]
    },
    {
        groupTitle: '2024',
        list: [
            {
                title: 'Баланс (Звіт про фінансовий стан) станом на 31.12.2024 р.',
                link: importDoc(
                    '/reports/2024/12m/Баланс (Звіт про фінансовий стан) станом на 31.12.2024 р..pdf'
                )
            },
            {
                title: 'Звiт про рух грошових коштiв (за прямим методом) за 2024 р',
                link: importDoc(
                    '/reports/2024/12m/Звiт про рух грошових коштiв (за прямим методом) за 2024 р.pdf'
                )
            },
            {
                title: 'Звіт про власний капітал за 2024 р.',
                link: importDoc(
                    '/reports/2024/12m/Звіт про власний капітал за 2024 р..pdf'
                )
            },
            {
                title:
                    'Звіт про фінансові результати (про сукупний дохід) за 2024 рік.',
                link: importDoc(
                    '/reports/2024/12m/Звіт про фінансові результати (про сукупний дохід) за 2024 рік.pdf'
                )
            },
            {
                title: 'Примітки до річної фінансової звітності за 2024 рік.',
                link: importDoc(
                    '/reports/2024/12m/Примітки до річної фінансової звітності за 2024' +
                    ' р.pdf'
                )
            },
            {
                title:
                    'Баланс (Звіт про фінансовий стан) станом на 30.09.2024 р. (25.10.2024)',
                link: importDoc(
                    '/reports/2024/9m/Баланс (Звіт про фінансовий стан) станом на 30.09.2024 р. (25.10.2024).pdf'
                )
            },
            {
                title:
                    'Звiт про рух грошових коштiв (за прямим методом) за 9 місяців 2024 р (25.10.2024)',
                link: importDoc(
                    '/reports/2024/9m/Звiт про рух грошових коштiв (за прямим методом) за 9 місяців 2024 р (25.10.2024).pdf'
                )
            },
            {
                title: 'Звіт про власний капітал за 9 місяців 2024 р. (25.10.2024)',
                link: importDoc(
                    '/reports/2024/9m/Звіт про власний капітал за 9 місяців 2024 р. (25.10.2024).pdf'
                )
            },
            {
                title:
                    'Звіт про фінансові результати (про сукупний дохід) за 9 місяців 2024 р (25.10.2024)',
                link: importDoc(
                    '/reports/2024/9m/Звіт про фінансові результати (про сукупний дохід) за 9 місяців 2024 р (25.10.2024).pdf'
                )
            },
            {
                title:
                    'Примітки до фінансової звітності за 9 місяців 2024 року  (25.10.2024)',
                link: importDoc(
                    '/reports/2024/9m/Примітки до фінансової звітності за 9 місяців' +
                    ' 2024 року  (25.10.2024).pdf'
                )
            },
            {
                title:
                    'Примітки до фінансової звітності за 1 півріччя 2024 року  (24.07.2024)',
                link: importDoc(
                    '/reports/2024/6m/Примітки до фінансової звітності за 1 півріччя 2024 року  (24.07.2024).pdf'
                )
            },
            {
                title:
                    'Звіт про фінансові результати (про сукупний дохід) за 1 півріччя 2024 р (24.07.2024)',
                link: importDoc(
                    '/reports/2024/6m/Звіт про фінансові результати (про сукупний дохід) за 1 півріччя 2024 р (24.07.2024).pdf'
                )
            },
            {
                title: 'Звіт про власний капітал за 1 півріччя  2024 р. (24.07.2024)',
                link: importDoc(
                    '/reports/2024/6m/Звіт про власний капітал за 1 півріччя  2024 р. (24.07.2024).pdf'
                )
            },
            {
                title:
                    'Звіт про фінансові результати (про сукупний дохід) за 1 півріччя 2024 р (24.07.2024)',
                link: importDoc(
                    '/reports/2024/6m/Звіт про фінансові результати (про сукупний дохід) за 1 півріччя 2024 р (24.07.2024).pdf'
                )
            },
            {
                title:
                    'Примітки до фінансової звітності за 1 півріччя 2024 року  (24.07.2024)',
                link: importDoc(
                    '/reports/2024/6m/Примітки до фінансової звітності за 1 півріччя' +
                    ' 2024 року  (24.07.2024).pdf'
                )
            },
            {
                title:
                    'Баланс (Звіт про фінансовий стан) станом на 31.03.2024 р. (21.04.2024)',
                link: importDoc(
                    '/reports/2024/3m/Баланс (Звіт про фінансовий стан) станом на 31.03.2024 р. (21.04.2024).pdf'
                )
            },
            {
                title:
                    'Звiт про рух грошових коштiв (за прямим методом) за 1 квартал 2024 р. (21.04.2024)',
                link: importDoc(
                    '/reports/2024/3m/Звiт про рух грошових коштiв (за прямим методом) за 1 квартал 2024 р. (21.04.2024).pdf'
                )
            },
            {
                title: 'Звіт про власний капітал за 1 квартал 2024 р. (21.04.2024)',
                link: importDoc(
                    '/reports/2024/3m/Звіт про власний капітал за 1 квартал 2024 р. (21.04.2024).pdf'
                )
            },
            {
                title:
                    'Звіт про фінансові результати (про сукупний дохід) за 1 квартал 2024 р (21.04.2024)',
                link: importDoc(
                    '/reports/2024/3m/Звіт про фінансові результати (про сукупний дохід) за 1 квартал 2024 р (21.04.2024).pdf'
                )
            },
            {
                title:
                    'Примітки до фінансової звітності за 1 квартал 2024 року (21.04.2024)',
                link: importDoc(
                    '/reports/2024/3m/Примітки до фінансової звітності за 1 квартал' +
                    ' 2024 року' +
                    ' (21.04.2024).pdf'
                )
            }
        ]
    },
    {
        groupTitle: '2023',
        list: [
            {
                title: 'Баланс (Звіт про фінансовий стан) станом на 31.12.2023 р',
                link: importDoc(
                    'Баланс (Звіт про фінансовий стан) станом на 31.12.2023 р.pdf'
                )
            },
            {
                title: 'Звіт про фінансові результати (про сукупний дохід) за 2023 р',
                link: importDoc(
                    'Звіт про фінансові результати (про сукупний дохід) за 2023 р.pdf'
                )
            },
            {
                title: 'Звіт про рух грошових коштів (за прямим методом) за 2023 р',
                link: importDoc(
                    'Звiт про рух грошових коштiв (за прямим методом) за 2023 р.pdf'
                )
            },
            {
                title: 'Звіт про власний капітал за 2023 р.',
                link: importDoc('Звіт про власний капітал за 2023 р.pdf')
            },
            {
                title: 'Примітки до річної фінансової звітності за 2023 р',
                link: importDoc('Примітки до річної фінансової звітності за 2023 р.pdf')
            }
        ]
    },
    {
        groupTitle: '2022',
        list: [
            {
                title: 'Баланс (Звіт про фінансовий стан) станом на 31.12.2022 р',
                link: importDoc('f1-2022.pdf')
            },
            {
                title: 'Звіт про фінансові результати (про сукупний дохід) за 2022 р',
                link: importDoc('f2-2022.pdf')
            },
            {
                title: 'Звіт про рух грошових коштів (за прямим методом) за 2022 р',
                link: importDoc('f3-2022.pdf')
            },
            {
                title: 'Звіт про власний капітал за 2022 р.',
                link: importDoc('f4-2022.pdf')
            },
            {
                title: 'Примітки до річної фінансової звітності за 2022 р',
                link: importDoc('f5-2022.pdf')
            }
        ]
    },
    {
        groupTitle: '2021',
        list: [
            {
                title: 'Баланс (Звіт про фінансовий стан) станом на 31.12.2021 р',
                link: importDoc('f1-2021.pdf')
            },
            {
                title: 'Звіт про фінансові результати (про сукупний дохід) за 2021 р',
                link: importDoc('f2-2021.pdf')
            },
            {
                title: 'Звіт про рух грошових коштів (за прямим методом) за 2021 р',
                link: importDoc('f3-2021.pdf')
            },
            {
                title: 'Звіт про власний капітал за 2021 р.',
                link: importDoc('f4-2021.pdf')
            },
            {
                title: 'Примітки до річної фінансової звітності за 2021 р',
                link: importDoc('prymitky_2021.doc')
            }
        ]
    }
];

export const managementReports: IDocumentsList[] = [
    {
        title: 'Звіт про управління за 2024 р. (29.04.2025)',
        link: importDoc('Звіт про управління за 2024 р. (29.04.2025).pdf')
    }
];

export const archivedInformation: IDocumentsList[] = [
    {
        title:
            'Правила надання коштів у позику, в тому числі і на умовах фінансового кредиту - Редакція, яка діяла до 14.06.2023 включно',
        link: importDoc('rules-credits-16082021.pdf')
    },
    {
        title: 'Кредити до 06.03.2024',
        link: importDoc('Rules_credits_Sent-Pro.pdf')
    },
    {
        title: 'Фінансовий лізинг до 06.03.2024',
        link: importDoc('pravyla_lizyngSP.pdf')
    },
    {
        title: 'Факторинг до 06.03.2024',
        link: importDoc('pravyla_faktoryngSP.pdf')
    },
    {
        title:
            'Порядок розгляду ТОВ «СЕНТ ПРО» звернень споживачів фінансових послуг',
        link: importDoc(
            '3.Poriadok_rozghliadu_zvernen_spozhyvachiv_TOV_SENT_PRO.pdf'
        )
    },
    {
        title:
            'ПРАВИЛА надання юридичним особам фінансової послуги з фінансового лізингу, діють з 06.03.2024',
        link: importDoc('PRAVYLA nadannia posluh z finansovoho lizynhu.pdf')
    },
    {
        title:
            'Правила надання юридичним особам та фізичним особам - підприємцям фінансової послуги з факторингу, діють з 06.03.2024',
        link: importDoc('PRAVYLA-faktorynhu.pdf')
    },
    {
        title:
            'Витяг з Державного реєстру фінансових установ наданий при переоформленні ліцензії 26.03.2024',
        link: importDoc('ТОВ_Сент_Про_витяг.pdf')
    }
];

export const auditReports: IDocumentsList[] = [
    {
        title: 'ТОВ «СЕНТ ПРО» Звіт незалежного аудитора за 2024 рік (НБУ)',
        link: importDoc(
            'ТОВ «СЕНТ ПРО» Звіт_незалежного_аудитора_за_2024_рік (НБУ).pdf'
        )
    },
    {
        title: 'ТОВ СЕНТ ПРО Звіт з надання впевненості за 2024 рік',
        link: importDoc('ТОВ СЕНТ ПРО   Звіт з надання впевненості за 2024 рік.pdf')
    },
    {
        title:
            'Звіт незалежного аудитора щодо фінансової звітності ТОВ «СЕНТ ПРО» за 2020 рік',
        link: importDoc('zvit-audit2020.pdf')
    },
    {
        title:
            'Звіт незалежного аудитора щодо фінансової звітності ТОВ «СЕНТ ПРО» за 2021 рік',
        link: importDoc('aud-zvit-2021.pdf')
    },
    {
        title:
            'Незалежний звіт з надання впевненості щодо річних даних за 2021' +
            ' рік',
        link: importDoc(
            'Незалежний_звіт_з_надання_впевненності_щодо_річних_звітних_даних 2021.pdf'
        )
    },
    {
        title:
            'Звіт незалежного аудитора щодо фінансової звітності ТОВ «СЕНТ ПРО» за 2022 рік',
        link: importDoc('zvit-audit2022.pdf')
    },
    {
        title:
            'Незалежний звіт з надання впевненості щодо річних даних за 2022' +
            ' рік',
        link: importDoc(
            'Незалежний звіт з надання впевненості щодо річних звітних даних 2022.pdf'
        )
    },
    {
        title:
            'Звіт незалежного аудитора щодо фінансової звітності ТОВ «СЕНТ ПРО»  за 2023 рік',
        link: importDoc(
            'ТОВ «СЕНТ ПРО» Звіт_незалежного_аудитора_за_2023_рік (НБУ).pdf'
        )
    },
    {
        title:
            'Незалежний звіт з надання впевненості щодо річних даних за 2023 рік',
        link: importDoc('ТОВ СЕНТ ПРО   Звіт з надання впевненості за 2023 рік.pdf')
    }
];

export const news: IDocumentsList[] = [
    {
        title: 'Інформаційне повідомлення про результати проведення конкурсу.',
        link: importDoc(
            '3. ІНФОРМАЦІЙНЕ ПОВІДОМЛЕННЯ_про результати конкурсу аудиту_СЕНТ ПРО 2024.pdf'
        )
    },
    {
        title:
            'Оголошення про проведення конкурсу з відбору суб’єкту аудиторської діяльності для проведення\n' +
            'аудиту фінансової звітності ТОВ «СЕНТ ПРО» за 2024 рік',
        link: importDoc(
            "2. Оголошення про проведення конкурсу з відбору суб'єкта аудиторської діяльності_ТОВ СЕНТ ПРО від 02.01.2025.pdf"
        )
    },
    {
        title:
            "Оголошення про проведення конкурсу з відбору суб'єкта аудиторської діяльності ТОВ «СЕНТ ПРО» від 31.01.2023 р.",
        link: importDoc('1.konkurs_audit_SENT_PRO.pdf')
    },
    {
        title:
            'ПОВІДОМЛЕННЯ ПРО ОБРАННЯ АУДИТОРСЬКОЇ ФІРМИ ДЛЯ ПРОВЕДЕННЯ АУДИТУ ЗА 2022 рік від 27.02.2023',
        link: importDoc('2.POVIDOMLENNYA_KONKURS-AUDIT_SENT_PRO_2023.pdf')
    },
    {
        title:
            'ПОРЯДОК проведення конкурсу з відбору суб’єктів аудиторської діяльності для надання послуг обов’язкового аудиту фінансової звітності ТОВ «СЕНТ ПРО»',
        link: importDoc('1poryadok-proved-konkursu-audit.pdf')
    },
    {
        title:
            "Оголошення про проведення конкурсу з відбору суб'єкта аудиторської діяльності_ТОВ «СЕНТ ПРО» від 04.01.2022",
        link: importDoc('2ogoloshennia-pro-proved-konkursu-audit.pdf')
    },
    {
        title:
            "Продовження конкурсу з відбору суб'єкта аудиторської діяльності_ТОВ «СЕНТ ПРО» від 21.01.2022",
        link: importDoc('3prodovzhennia-konkursu-audit.pdf')
    },
    {
        title:
            "Продовження конкурсу з відбору суб'єкта аудиторської діяльності_ТОВ «СЕНТ ПРО» від 21.02.2022",
        link: importDoc('4prodovzhennia-konkursu-audit.pdf')
    },
    {
        title:
            "Продовження конкурсу з відбору суб'єкта аудиторської діяльності_ТОВ «СЕНТ ПРО» від 21.03.2022",
        link: importDoc('5prodovzhennia-konkursu-audit.pdf')
    },
    {
        title:
            "Продовження конкурсу з відбору суб'єкта аудиторської діяльності_ТОВ «СЕНТ ПРО» від 21.04.2022",
        link: importDoc('6prodovzhennia-konkursu-audit.pdf')
    },
    {
        title:
            "Продовження конкурсу з відбору суб'єкта аудиторської діяльності_ТОВ «СЕНТ ПРО» від 21.05.2022",
        link: importDoc('7prodovzhennia-konkursu-audit.pdf')
    },
    {
        title:
            "Продовження конкурсу з відбору суб'єкта аудиторської діяльності_ТОВ «СЕНТ ПРО» від 21.06.2022",
        link: importDoc('8prodovzhennia-konkursu-audit.pdf')
    },
    {
        title:
            "Продовження конкурсу з відбору суб'єкта аудиторської діяльності_ТОВ «СЕНТ ПРО» від 21.07.2022",
        link: importDoc('9prodovzhennia-konkursu-audit.pdf')
    },
    {
        title:
            "Продовження конкурсу з відбору суб'єкта аудиторської діяльності_ТОВ «СЕНТ ПРО» від 21.08.2022",
        link: importDoc('10prodovzhennia-konkursu-audit.pdf')
    },
    {
        title:
            'ІНФОРМАЦІЙНЕ ПОВІДОМЛЕННЯ_про результати конкурсу аудиту_ТОВ «СЕНТ ПРО» 2021',
        link: importDoc('11-povidomlennia-rez-konkursu-audit2021.pdf')
    }
];
