import Accordion from '@modules/common/components/Accordion';
import DocumentsList from '@modules/common/components/DocumentsList';
import SplitBlocks from '@modules/common/components/SplitBlocks';
import {
	archivedInformation,
	auditReports,
	financeReports,
	infoFinancialInstitution,
	infoOwnershipStructure,
	innerRules,
	managementReports,
	news
} from '@modules/home/components/Reports/data';

const Reports = () => {
	return (
		<SplitBlocks title="звітність" titleType="heading" anchor="reports">
			<Accordion title="Внутрішні правила">
				<DocumentsList list={innerRules} />
			</Accordion>

			<Accordion title="Інформація про фінансову установу">
				<p>
					<strong>Повне найменування юридичної особи</strong>
				</p>
				<p>{`ТОВАРИСТВО З ОБМЕЖЕНОЮ ВІДПОВІДАЛЬНІСТЮ "СЕНТ ПРО" (ТОВ "СЕНТ ПРО")`}</p>
				<br />
				<p>
					<strong>Ідентифікаційний код юридичної особи</strong>
				</p>
				<p>Код ЄДРПОУ 43580771</p>
				<br />
				<p>
					<strong>Місцезнаходження юридичної особи</strong>
				</p>
				<p>Україна, 03056, місто Київ, вул.Борщагівська, будинок 154</p>
				<br />
				<p>
					<strong>Перелік учасників ТОВ «СЕНТ ПРО»:</strong>
				</p>
				<br />
				<p>
					Шалуєв Денис Вячеславович – 100%. Особа є учасником Товариства, якій
					належить 100,00% в статутному капіталі юридичної особи.
				</p>
				<br />
				<p>
					<strong>
						Дані про розмір статутного капіталу (статутного або складеного капіталу)
						та про дату закінчення його формування
					</strong>
				</p>
				<p>Розмір (грн.): 5100000.00</p>
				<br />
				<p>
					<strong>Відомості про органи управління юридичної особи</strong>
				</p>

				<p>ЗАГАЛЬНІ ЗБОРИ УЧАСНИКІВ; ДИРЕКТОР</p>
				<br />
				<p>
					<strong>
						Прізвище, ім{"'"}я, по батькові, дата обрання (призначення) осіб, які
						обираються (призначаються) до органу управління юридичної особи,
						уповноважених представляти юридичну особу у правовідносинах з третіми
						особами, або осіб, які мають право вчиняти дії від імені юридичної особи
						без довіреності, у тому числі підписувати договори та дані про наявність
						обмежень щодо представництва від імені юридичної особи
					</strong>
				</p>
				<br />
				<p>БОГДАН ОЛЕКСАНДР ЄВГЕНОВИЧ - керівник</p>
				<br />
				<p>
					<strong>
						Дата та номер запису в Єдиному державному реєстрі про проведення державної
						реєстрації юридичної особи – у разі, коли державна реєстрація юридичної
						особи була проведена після набрання чинності Законом України &quot;Про
						державну реєстрацію юридичних осіб та фізичних осіб-підприємців&quot;
					</strong>
				</p>

				<br />
				<p>
					Дата запису: 30.03.2020 <br /> Номер запису: 1 070 102 0000 087169
				</p>
				<br />
				<p>
					<strong>Місцезнаходження реєстраційної справи</strong>
				</p>

				<p>Солом{"'"}янська районна в місті Києві державна адміністрація</p>
				<br />
				<p>
					<strong>
						Дата та номер запису про взяття та зняття з обліку, назва та
						ідентифікаційні коди органів статистики, Міндоходів, Пенсійного фонду
						України, в яких юридична особа перебуває на обліку:
					</strong>
				</p>

				<p>
					31.03.2020, ДЕРЖАВНА СЛУЖБА СТАТИСТИКИ УКРАЇНИ, 37507880; 30.03.2020,
					265520083212, ГОЛОВНЕ УПРАВЛІННЯ ДПС У М.КИЄВІ, ДПІ У СОЛОМ{"'"}ЯНСЬКОМУ
					РАЙОНІ (СОЛОМ{"'"}ЯНСЬКИЙ РАЙОН М.КИЄВА), 43141267, 22.01.2021, (дані про
					взяття на облік як платника податків); 30.03.2020, 10000001775318, ГОЛОВНЕ
					УПРАВЛІННЯ ДПС У М.КИЄВІ, ДПІ У СОЛОМ{"'"}ЯНСЬКОМУ РАЙОНІ (СОЛОМ{"'"}
					ЯНСЬКИЙ РАЙОН М.КИЄВА), 43141267, (дані про взяття на облік як платника
					єдиного внеску)
				</p>
				<br />
				<p>
					<strong>
						Дані про реєстраційний номер платника єдиного внеску, клас професійного
						ризику виробництва платника єдиного внеску за основним видом його
						економічної діяльності
					</strong>
				</p>
				<br />
				<p>Дані про реєстраційний номер платника єдиного внеску: 10000001775318</p>
				<br />
				<p>
					<strong>Інформація про здійснення зв{"'"}язку з юридичною особою</strong>
				</p>
				<br />
				<p>
					Телефон 1: +38(091)-481-94-67 <br />
					Адреса електронної пошти:{' '}
					<a href="mailto:office@sentpro.com.ua" target="_blank" rel="noreferrer">
						office@sentpro.com.ua
					</a>
				</p>

				<DocumentsList list={infoFinancialInstitution} />
			</Accordion>

			<Accordion title="Інформація про структуру власності">
				<DocumentsList groupList={infoOwnershipStructure} />
			</Accordion>

			<Accordion title="Аудиторські висновки">
				<DocumentsList list={auditReports} />
			</Accordion>

			<Accordion title="Фінансова звітність">
				<DocumentsList groupList={financeReports} />
			</Accordion>

			<Accordion title="Звіт про управління">
				<DocumentsList list={managementReports} />
			</Accordion>

			<Accordion title="Архівна інформація">
				<DocumentsList list={archivedInformation} />
				<br />
				<p>
					<strong>Факторинг</strong>
				</p>{' '}
				<br />
				<p>Базові умови, ціна та тарифи послуги з факторингу:</p>
				<ol>
					<li>
						Вид операцій
						<br />
						Факторинг з регресом.
					</li>
					<li>
						Валюта операцій
						<br />
						Гривня.
					</li>
					<li>
						Період відстрочки платежу
						<br />
						До 91 дня.
					</li>
					<li>
						Вимоги до клієнта
						<br />
						Юридичні або фізичні особи – підприємці, які працюють на ринку більше 1
						року, та здійснюють підприємницьку діяльність.
					</li>
					<li>
						Вимоги до боржника
						<br />
						Співпраця з клієнтом не менш ніж 6 місяців, за які здійснено не менше 3
						поставок продукції або послуг.
					</li>
					<li>
						Максимальний розмір фінансування
						<br />
						85 % від суми боргу, підтвердженого документально.
					</li>
					<li>
						Процентна ставка фінансування
						<br />
						25 % річних.
					</li>
					<li>
						{' '}
						Комісійна винагорода за обслуговування
						<br />1 % від суми фінансування.
					</li>
				</ol>
				<br />
				<p>
					{' '}
					Остаточні умови укладення договору факторингу визначаються рішенням
					уповноваженого органу компанії, застосовуючи принципи індивідуального
					підходу до кожного клієнта.
				</p>
				<br />
				<p>
					<strong>Лізинг</strong>
				</p>{' '}
				<br />
				<p>Базові умови, ціна та тарифи фінансового лізингу:</p>
				<ol>
					<li>
						Вид операцій
						<br />
						Фінансовий лізинг.
					</li>
					<li>
						Валюта операцій
						<br />
						Гривня.
					</li>
					<li>
						Строк лізингу
						<br />
						Від 12 до 60 місяців.
					</li>
					<li>
						Об’єкти лізингу
						<br />
						Легкові та вантажні автомобілі, автобуси.
					</li>
					<li>
						Авансовий платіж
						<br />
						Від 20 % вартості майна.
					</li>
					<li>
						Періодичність лізингових платежів
						<br />
						Щомісячно, рівними частинами.
					</li>
					<li>
						Ставка лізингових процентів
						<br />
						Від 21 % річних.
					</li>
					<li>
						Комісійна винагорода
						<br />1 % від суми фінансування (без урахування авансового платежу).
					</li>
					<li>
						Перехід права власності
						<br />
						Після повної сплати лізингових платежів.
					</li>
				</ol>
				<br />
				<p>
					Остаточні умови укладення договору фінансового лізингу визначаються
					рішенням уповноваженого органу компанії, застосовуючи принципи
					індивідуального підходу до кожного клієнта.
				</p>
			</Accordion>

			<Accordion title="Оголошення/Повідомлення">
				<DocumentsList list={news} />
			</Accordion>
		</SplitBlocks>
	);
};

export default Reports;
