import { FC, type ReactNode } from 'react';

import BlockTitle from '@modules/common/components/BlockTitle';
import IconFrame from '@modules/common/components/IconFrame';
import SplitBlocks from '@modules/common/components/SplitBlocks';
import { advantagesList } from '@modules/home/components/About/data';

import s from './About.module.scss';

const About: FC<{
	children?: ReactNode;
}> = ({ children }) => {
	return (
		<section id="about">
			<SplitBlocks title={`ПОПЕРЕДЖЕННЯ`} titleType="text">
				<p>
					ТОВ «СЕНТ ПРО», код ЄДРПОУ 43580771 (далі – Товариство) надає єдиний вид
					фінансової послуги: надання коштів та банківських металів у кредит. <br />{' '}
					<br />
					Комітет з питань нагляду та регулювання діяльності ринків небанківських
					фінансових послуг Національного банку України 27.09.2024 прийняв рішення
					про надання погодження ТОВ “СЕНТ ПРО” зміни обсягу ліцензії (звуження) на
					діяльність фінансової компанії та виключення з такої ліцензії фінансових
					послуг: факторинг, фінансовий лізинг.
				</p>

				<p>ПОПЕРЕДЖЕННЯ, ЩОДО НАДАННЯ ФІНАНСОВИХ ПОСЛУГ:</p>
				<ul>
					<li>
						<p> Товариство не надає фінансові послуги фізичним особам.</p>
					</li>
					<li>
						<p>Товариство не надає споживчі кредити.</p>
					</li>
					<li>
						<p>
							Товариство має намір здійснювати діяльність із врегулювання простроченої
							заборгованості у розумінні вимог Закону України «Про споживче
							кредитування». Заява від Товариства про включення небанківської
							фінансової установи до реєстру колекторських компаній подана до
							Національного банку України, після прийняття Регулятором рішення буде
							оновлена відповідна інформація на цьому Сайті.
						</p>
					</li>
				</ul>
			</SplitBlocks>

			<BlockTitle title="Про компанію" />

			<ul className={s.advantages}>
				{advantagesList.map((item) => (
					<li className={s.advantagesItem} key={item.desc}>
						<IconFrame icon={item.icon} />
						<p className={s.advantagesDesc}>{item.desc}</p>
					</li>
				))}
			</ul>

			<SplitBlocks title={`Про ТОВ «СЕНТ ПРО»`} titleType="text">
				<p>
					Товариство є небанківською фінансовою установою (фінансовою компанією),
					інформація про яку внесена до Державного реєстру фінансових установ, який
					веде Національний банк України, має Свідоцтво про реєстрацію фінансової
					установи серії ФК №В0000145, дата видачі свідоцтва 27.01.2021.
				</p>

				<p>
					Національний банк України ліцензії Товариства, які були видані Товариству
					09.06.2020: на надання коштів у позику, в тому числі і на умовах
					фінансового кредиту; на надання послуг з факторингу; на надання послуг з
					фінансового лізингу, 26.03.2024 переоформив на ліцензію на діяльність
					фінансової компанії з правом надання видів фінансових послуг: надання
					коштів та банківських металів у кредит; факторинг; фінансовий лізинг.
					Відповідно до заяви Товариства Комітет з питань нагляду та регулювання
					діяльності ринків небанківських фінансових послуг Національного банку
					України 27.09.2024 прийняв рішення про надання погодження ТОВ “СЕНТ ПРО”
					зміни обсягу ліцензії (звуження) на діяльність фінансової компанії та
					виключення з такої ліцензії фінансових послуг: факторинг, фінансовий
					лізинг. Товариство надає єдиний вид фінансової послуги: надання коштів та
					банківських металів у кредит.
				</p>

				<p>
					Ідентифікаційний код юридичної особи: 43580771
					<br />
					Місцезнаходження юридичної особи: Україна, 03056, місто Київ, вул.
					Борщагівська, буд. 154
					<br />
					Керівник - БОГДАН ОЛЕКСАНДР ЄВГЕНОВИЧ
					<br />
					Звертатися з отримання фінансових послуг можете за адресою: Україна, 03056,
					місто Київ, вул.Борщагівська, будинок 154 або за телефоном
					+38(091)-481-94-67
				</p>
			</SplitBlocks>

			{children}
		</section>
	);
};

export default About;
