import BlockTitle from '@modules/common/components/BlockTitle';
import IconFrame from '@modules/common/components/IconFrame';
import SplitBlocks from '@modules/common/components/SplitBlocks';

import s from './HomeAbout.module.scss';
import Accordion from "@modules/common/components/Accordion";
import {
	advantagesList,
	lendingDocumentsList
} from "@modules/home/components/HomeAbout/data";
import DocumentsList from "@modules/common/components/DocumentsList";

const HomeAbout = () => {
	return (
		<section id="about">
			<BlockTitle title="Про компанію"/>

			<ul className={s.advantages}>
				{advantagesList.map((item) => (
					<li className={s.advantagesItem} key={item.desc}>
						<IconFrame icon={item.icon}/>
						<p className={s.advantagesDesc}>{item.desc}</p>
					</li>
				))}
			</ul>

			<SplitBlocks
				title={`ТОВАРИСТВО З ОБМЕЖЕНОЮ ВІДПОВІДАЛЬНІСТЮ "СЕНТ ПРО" (ТОВ "СЕНТ ПРО") зареєстроване як фінансова установа відповідно до Розпорядження Національної комісії`}
				titleType="text"
			>
				<p>
					Установа здійснює державне регулювання у сфері ринків фінансових
					послуг від
					02.06.2020 року № 1123 (Свідоцтво про реєстрацію фінансової установи
					ФК
					№В0000145 від 27.01.2021) господарська діяльність установи полягає у
					наданні фінансових послуг:
				</p>
				<ul>
					<li>надання коштів та банківських металів у кредит;</li>
					<li>надання послуг з факторингу;</li>
					<li>надання послуг з фінансового лізингу.</li>
				</ul>

				<p>
					Ідентифікаційний код юридичної особи: 43580771
					<br/>
					Місцезнаходження юридичної особи: Україна, 03056, місто Київ, вул.
					Борщагівська, буд. 154
					<br/>
					Керівник - БОГДАН ОЛЕКСАНДР ЄВГЕНОВИЧ
					<br/>
					Звертатися з отримання фінансових послуг можете за адресою: Україна,
					03056,
					місто Київ, вул.Борщагівська, будинок 154 або за телефоном
					+38(091)-481-94-67
				</p>
				<p>
					<strong>Товариство не надає </strong>
					{`споживчі кредити у розумінні Закону України "Про споживче кредитування" ТОВ «СЕНТ ПРО» не здійснює кредитування фізичних осіб та не здійснює врегулювання простроченої заборгованості фізичних осіб.`}
				</p>
			</SplitBlocks>

			<SplitBlocks
				title="Фінансові послуги"
				titleType="heading"
				anchor="fin-services"
			>
				<Accordion title="Кредитування">
					<DocumentsList list={lendingDocumentsList}/>
				</Accordion>

				<Accordion title="Факторинг">
					Базові умови, ціна та тарифи послуги з факторингу:

					<ol>
						<li>Вид операцій<br/>
							Факторинг з регресом.
						</li>
						<li>Валюта операцій<br/>
							Гривня.
						</li>
						<li>Період відстрочки платежу<br/>
							До 91 дня.
						</li>
						<li>Вимоги до клієнта<br/>
							Юридичні або фізичні особи – підприємці, які працюють на ринку
							більше
							1 року, та здійснюють підприємницьку діяльність.
						</li>
						<li>Вимоги до боржника<br/>
							Співпраця з клієнтом не менш ніж 6 місяців, за які здійснено не
							менше
							3 поставок продукції або послуг.
						</li>
						<li>Максимальний розмір фінансування<br/>
							85 % від суми боргу, підтвердженого документально.
						</li>
						<li>Процентна ставка фінансування<br/>
							25 % річних.
						</li>
						<li> Комісійна винагорода за обслуговування<br/>
							1 % від суми фінансування.
						</li>
					</ol>
					<br/>
					Остаточні умови укладення договору факторингу визначаються рішенням
					уповноваженого органу компанії, застосовуючи принципи індивідуального
					підходу до кожного клієнта.
				</Accordion>

				<Accordion title="Лізинг">
					Базові умови, ціна та тарифи фінансового лізингу:

					<ol>
						<li>Вид операцій<br/>
							Фінансовий лізинг.
						</li>
						<li>Валюта операцій<br/>
							Гривня.
						</li>
						<li>Строк лізингу<br/>
							Від 12 до 60 місяців.
						</li>
						<li>Об’єкти лізингу<br/>
							Легкові та вантажні автомобілі, автобуси.
						</li>
						<li>Авансовий платіж<br/>
							Від 20 % вартості майна.
						</li>
						<li>Періодичність лізингових платежів<br/>
							Щомісячно, рівними частинами.
						</li>
						<li>Ставка лізингових процентів<br/>
							Від 21 % річних.
						</li>
						<li>Комісійна винагорода<br/>
							1 % від суми фінансування (без урахування авансового платежу).
						</li>
						<li>Перехід права власності<br/>
							Після повної сплати лізингових платежів.
						</li>
					</ol>
					<br/>
					Остаточні умови укладення договору фінансового лізингу визначаються
					рішенням уповноваженого органу компанії, застосовуючи принципи
					індивідуального підходу до кожного клієнта.
				</Accordion>
			</SplitBlocks>
		</section>
	);
};

export default HomeAbout;
